## Standardization (z-score Scaling)

Standardization is just transforming your columns/features so that they have a mean = 0 and standard deviation = 1.

Formula :     

                                       Xi' = (Xi - mean) / standard deviation


### After transfromation your features:
- Mean = 0 
- Standard deviation = 1
- Distribution shape does not changes

### Key Ponits
- Standardization is usually applied to those algorithms that assume features are normally/bell shaped distributed.\
  For Example: Linear regression, Logistic regression, SVM, PCA.
- It is recommended that 
  1. Use feature scaling after train split test
  2. Fit on traning data
  3. Transform on both training and testing data.
- Less sensitive to outliers.

In [41]:
# import liberaries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [42]:
# Load the dataset
df = pd.read_csv("Social_Network_Ads.csv")

In [43]:
# Lets see how our data looks like
df.sample(5)

      User ID  Gender  Age  EstimatedSalary  Purchased
310  15717893  Female   42            70000          0
287  15761950  Female   48           138000          1
199  15708228    Male   35            22000          0
323  15619465  Female   48            30000          1
336  15664907    Male   58           144000          1

In [44]:
# Filtering the data that is of our use for now
df = df.iloc[:, 2:]
df.sample(5)

     Age  EstimatedSalary  Purchased
197   20            36000          0
243   56           104000          1
219   59           143000          1
394   39            59000          0
4     19            76000          0

In [45]:
# train_test_split the data
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df.drop('Purchased', axis = 1), df["Purchased"], test_size = 0.5, random_state = 0)

## Standard Scalar

In [46]:
from sklearn.preprocessing import StandardScaler

ss = StandardScaler()

ss.fit(X_train)

X_train_transformed = ss.transform(X_train)
X_test_transformed = ss.transform(X_test)